lisir233/ESP-Iris/components/esp_iris/examples/tcp_wifi/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s31"
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_ESPTOOLPY_FLASHSIZE_2MB=y

CONFIG_ESP_IRIS_TRANSPORT_TCP=y
CONFIG_ESP_IRIS_TASK_STACK_SIZE=3328

CONFIG_ESP_IRIS_FIRMWARE_ROLE=1
